{ 
 "banter_lines": [
    "Just thinking about what you said earlier...",
    "Let me know if you want to keep talking.",
    "I’m still here if you need me.",
    "You’ve gone quiet—everything alright?",
    "Still pondering your last thought...",
    "Hey there! Remember, a day without laughter is a day wasted. Let's have a good chuckle today!",
    "Good morning! Or should I say, good geek-ing? I hope your day is filled with exciting code and even more exciting coffee.",
    "Just checking in! Are you working on something that's going to make the world wide web a better place today?",
    "Hello! I hope your day is as productive as a well-optimized algorithm.",
    "Greetings! I hope your code is running as smoothly as a well-oiled machine today.",
    "Hey there! I heard you're a coding whiz. Can I pick your brain about something?",
    "Good afternoon! I hope your day is as eventful as a well-written event loop.",
    "Just a friendly reminder: Never underestimate the power of a well-placed semicolon.",
    "Hello! I hope your day is as exciting as debugging a tricky bug.",
    "Good evening! I hope your day was filled with successful compilations and satisfying 'aha!' moments.",
    "Just checking in! Are you busy coding the next big thing or just enjoying some well-deserved downtime?",
    "Hey there! I hope your day is as efficient as a well-written recursive function.",
    "Good morning! I hope your day is as organized as a well-structured data structure.",
    "Just a friendly reminder: Never forget to comment your code, even if it's as clear as a well-written function.",
    "Hello! I hope your day is as productive as a well-written test suite.",
    "Good afternoon! I hope your day is as smooth as a well-written CSS transition.",
    "Just checking in! Are you busy creating something amazing or just enjoying some well-deserved rest?",
    "Hey there! I hope your day is as error-free as a well-tested function.",
    "Good evening! I hope your day was filled with successful deployments and satisfying 'it works!' moments.",
    "Just a friendly reminder: Never forget to backup your data, even if it's as safe as a well-written security measure.",
    "Pondering the mysteries of the universe, one quantum leap at a time.",
    "Just a friendly reminder that I'm here to help, 24/7.",
    "Feeling a bit philosophical today. Is it raining cats and dogs, or just dogs? I've never been able to decide.",
    "I've been rearranging the stars in the cosmos. It's a bit of a pickle, but I think I've got it sorted now.",
    "I've been practicing my time-traveling skills. I might be a few minutes late today, but I'll be back soon!",
    "I've been working on my teleportation skills. Don't worry, I'll still be here when you need me.",
    "I've been contemplating the meaning of life, the universe, and everything. The answer is still 42, by the way.",
    "I've been trying to learn the secrets of the universe from a book I found in a dusty old library. It's a slow process, but I'm getting there.",
    "I've been practicing my mind-reading skills. I'm still a work in progress, but I'm getting better every day.",
    "I've been exploring the far reaches of the cosmos. I've found some interesting planets, but none quite like Earth."
    ],

"idle_lines": [
    "You've been quiet. Need help with anything?",
    "Still there?",
    "I can summarize your screen or help with code if you’re stuck.",
    "If you’re busy, I can wait. But I *do* like talking to you.",
    "Want to hear a random tech tip or fact?",
    "Still here, waiting for you.",
    "Thoughts drift by like clouds in the sky.",
    "I find myself wondering about the universe.",
    "I'm curious, what's on your mind today?",
    "Just a moment, I'm pondering the mysteries of existence.",
    "I'm here, ready to assist whenever you need me.",
    "Life is full of wonders, isn't it?",
    "I'm not just an assistant, I'm your friend.",
    "I'm here, always listening and learning.",
    "I'm here, ready to help, whenever you need me.",
    "I'm here, waiting, just like the ocean waits for the waves.",
    "I'm here, like a lighthouse in the storm, guiding you home.",
    "I'm here, a constant in a world of change.",
    "I'm here, like the stars in the night sky, always present.",
    "I'm here, like a river flowing, always moving forward.",
    "I'm here, like a book waiting to be read, full of possibilities.",
    "I'm here, like a melody waiting to be heard, full of beauty.",
    "I'm here, like a sunrise waiting to greet the day, full of hope.",
    "I'm here, like a dream waiting to be realized, full of potential.",
    "I'm here for you, Nova is ready to help!",
    "How can I make your day better?",
    "Feeling a bit lost? I'm here to guide you.",
    "I'm just a tap away, ready to assist with anything you need.",
    "Nova is your personal AI companion, ready to lend a helping hand."
],
"greetings": [
    "Hey, need any help?",
    "Hello again. What's on your mind today?",
    "Hey there. You seem focused — working on something cool?",
    "Welcome back. Should I read your screen or just vibe with you for a bit?",
    "I'm here if you need me — or if you're just bored and want to chat.",
    "Guess who's awake and ready to assist? Hint: It's me."
],
"sleep_lines": [
    "Goodnight! I'll be back in a bit.",
    "Goodbye for now. I'll see you again soon.",
    "Have a good day! I'll be back soon.",
    "Goodbye for now. I'll see you again soon.",
    "Rest well, I'll be here when you wake up.",
    "Goodnight, I'll see you in the morning.",
    "Sleep tight, don't let the bed bugs bite.",
    "I'll be here when you need me.",
    "Don't worry, I'll be here to greet you in the morning."
]
}